In [62]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password=""
)

mycursor = mydb.cursor()
#database
mycursor.execute("CREATE DATABASE university")

In [63]:
import mysql.connector
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="",
  database="university"
)

mycursor = mydb.cursor()
#creation of table
mycursor.execute("CREATE TABLE `book`( `id` INT(10) NOT NULL , `Name` VARCHAR(50) NOT NULL , `price` INT(25) NOT NULL , PRIMARY KEY (`id`))")

In [64]:
#insertion
mycursor.execute("INSERT INTO `book` (`id`, `Name`, `price`) VALUES ('100', 'Harry Potter and the Sorcerer’s Stone', '2000')")
#mycursor.execute("INSERT INTO `book` (`id`, `Name`, `price`) VALUES ('101', 'Island of the Blue Dolphins', '1500')")
#mycursor.execute("INSERT INTO `book` (`id`, `Name`, `price`) VALUES ('112', 'julius caeser’s ', '2500')")
#mycursor.execute("INSERT INTO `book` (`id`, `Name`, `price`) VALUES ('104', 'The final problem', '3000')")
#mycursor.execute("INSERT INTO `book` (`id`, `Name`, `price`) VALUES ('120', 'Harry Potter and the Prisoner of Azkaban', '1200')")
#mycursor.execute("INSERT INTO `book` (`id`, `Name`, `price`) VALUES ('102', 'Harry Potter and the Order of the phoenix', '2300')")
mydb.commit()
print(mycursor.rowcount, "record inserted.")

1 record inserted.

In [66]:
sql = "INSERT INTO book (id,name,price) VALUES (%s, %s,%s)"
val = [
    ("101", "Island of the Blue Dolphins", "1500"),
    ("112", "julius caeser’s ", "2500"),
    ("104", "The final problem", "3000"),
    ("120", "Harry Potter and the Prisoner of Azkaban", "1200"),
    ("102", "Harry Potter and the Order of the phoenix", "2300")
]
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, "record(s) inserted.")

5 record(s) inserted.

In [67]:
#display
mycursor.execute("SELECT * FROM book")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(100, 'Harry Potter and the Sorcerer’s Stone', 2000)
(101, 'Island of the Blue Dolphins', 1500)
(112, 'julius caeser’s ', 2500)
(104, 'The final problem', 3000)
(120, 'Harry Potter and the Prisoner of Azkaban', 1200)
(102, 'Harry Potter and the Order of the phoenix', 2300)

In [68]:
#order
mycursor.execute("SELECT * FROM book ORDER BY id ")
myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(100, 'Harry Potter and the Sorcerer’s Stone', 2000)
(101, 'Island of the Blue Dolphins', 1500)
(102, 'Harry Potter and the Order of the phoenix', 2300)
(104, 'The final problem', 3000)
(112, 'julius caeser’s ', 2500)
(120, 'Harry Potter and the Prisoner of Azkaban', 1200)

In [69]:
#search
mycursor.execute("SELECT * FROM book WHERE id ='100'")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(100, 'Harry Potter and the Sorcerer’s Stone', 2000)

In [70]:
#delete
mycursor.execute("DELETE FROM book WHERE price = '3000'")

In [71]:
mycursor.execute("SELECT * FROM book")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(100, 'Harry Potter and the Sorcerer’s Stone', 2000)
(101, 'Island of the Blue Dolphins', 1500)
(112, 'julius caeser’s ', 2500)
(120, 'Harry Potter and the Prisoner of Azkaban', 1200)
(102, 'Harry Potter and the Order of the phoenix', 2300)

In [72]:
mycursor.execute("UPDATE book SET price = '3000' WHERE id = '100'")

In [73]:
mycursor.execute("SELECT * FROM book")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(100, 'Harry Potter and the Sorcerer’s Stone', 3000)
(101, 'Island of the Blue Dolphins', 1500)
(112, 'julius caeser’s ', 2500)
(120, 'Harry Potter and the Prisoner of Azkaban', 1200)
(102, 'Harry Potter and the Order of the phoenix', 2300)

In [74]:
#mycursor.execute("DROP TABLE book")

In [75]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('book',)
('student',)